# Задача 1
#
# Напишіть программу "Касир в кінотеватрі", яка попросить користувача ввести свій вік
# (можна використати константу або функцію input(), на екран має бути виведено лише одне повідомлення).
#
# якщо користувачу менше 7 - вивести повідомлення"Де твої батьки?"
#
# якщо користувачу менше 16 - вивести повідомлення "Це фільм для дорослих!"
#
# якщо від 16 до 65 то зробіть якесь вітальне повідомлення, на ваш розсуд.
# якщо користувачу більше 65 - вивести повідомлення"Покажіть пенсійне посвідчення!"

print('Задача 1. Касир в кінотеватрі')
age = int(input('Ведите свой возраст (полных лет): '))
if age <= 0:
    print('Invalid number entered!')
elif age > 0 and age < 7:
    print('Де твої батьки?')
elif age >= 7 and age < 16:
    print('Це фільм для дорослих!')
elif age >= 16 and age < 65:
    print('Hi man!')
else:
    print('Покажіть пенсійне посвідчення!')